# St7SetTableTypeName

Sets the name of the specified table.

long St7SetTableTypeName(long uID, long TableType, long TableID, char* TableName)
Input Parameters
uID
Strand7 model file ID.
TableType
One of the table types listed in Table Types.
TableID
Table ID.
TableName
Name of the table.